Checks whether this dimension style can have an equality formular.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
 Syntax
  C#
public bool CanHaveEqualityFormula()
  Visual Basic
Public Function CanHaveEqualityFormula As Boolean
  Visual C++
public:
bool CanHaveEqualityFormula()
 Return Value
 True when the DimensionType is continuous linear or angular, false otherwise.
 Remarks
 It returns true when the DimensionType is continuous linear or angular.
 See Also
  DimensionType Class
  Autodesk.Revit.DB Namespace